{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.5.0", "signature": {"inputs": {"gradient_boosted_trees_model_5/129138:0": {"name": "gradient_boosted_trees_model_5/129138:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 129059}, "args_0:0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "24"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "args_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "24"}]}}}}, {"name": "gradient_boosted_trees_model_5/129138", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4", "op": "NoOp", "input": ["^args_0", "^gradient_boosted_trees_model_5/129138"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_10/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_10/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_10/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_11/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_11/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_11/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_12/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_12/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_12/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_13/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_13/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_13/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_14/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_14/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_14/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_15/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_15/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_15/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_16/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_16/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_16/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_17/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_17/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_17/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_18/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_18/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_18/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_19/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_19/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_19/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_20/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_20/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_20/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_21/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_21/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_21/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_22/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_22/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_22/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_23/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_23/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_23/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_8/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_8/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_8/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "op": "Identity", "input": ["args_0", "^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_9/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_9/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_9/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/Const_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "1"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_10", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_10/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_10/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_10/stack_2"], "attr": {"end_mask": {"i": "1"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_11", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_11/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_11/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_11/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_12", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_12/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_12/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_12/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_13", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_13/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_13/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_13/stack_2"], "attr": {"begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_14", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_14/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_14/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_14/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_15", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_15/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_15/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_15/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_16", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_16/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_16/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_16/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_17", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_17/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_17/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_17/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_18", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_18/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_18/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_18/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_19", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_19/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_19/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_19/stack_2"], "attr": {"begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_20", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_20/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_20/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_20/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_21", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_21/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_21/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_21/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_22", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_22/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_22/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_22/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_23", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_23/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_23/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_23/stack_2"], "attr": {"begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_3", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack_2"], "attr": {"end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_4", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_5", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack_1", "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}}}, {"name": "gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/strided_slice_6", "op": "StridedSlice", "input": ["Func/gradient_boosted_trees_model_5/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/input/_10", 